In [1]:
# Create a DataFrame to simulate student exam scores
import pandas as pd

In [5]:
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Math': [85, 78, 92, 69, 88],
    'Physics': [90, 72, 85, 60, 95],
    'Chemistry': [78, 85, 80, 75, 92]
}

In [7]:
data

{'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'Math': [85, 78, 92, 69, 88],
 'Physics': [90, 72, 85, 60, 95],
 'Chemistry': [78, 85, 80, 75, 92]}

In [9]:
type(data)

dict

In [11]:
df = pd.DataFrame(data)

In [13]:
df

   Student  Math  Physics  Chemistry
0    Alice    85       90         78
1      Bob    78       72         85
2  Charlie    92       85         80
3    David    69       60         75
4      Eva    88       95         92

In [23]:
df['Average Score'] = df[['Math', 'Physics', 'Chemistry']].mean(axis = 1)

In [25]:
df

   Student  Math  Physics  Chemistry  Average Score
0    Alice    85       90         78      84.333333
1      Bob    78       72         85      78.333333
2  Charlie    92       85         80      85.666667
3    David    69       60         75      68.000000
4      Eva    88       95         92      91.666667

In [29]:
filtered_data = df[( df['Math'] > 80 ) &
               ( df['Physics'] > 80 ) &
                ( df['Chemistry'] > 80 )
]

In [31]:
print(filtered_data)

  Student  Math  Physics  Chemistry  Average Score
4     Eva    88       95         92      91.666667

In [37]:
highest_score = df[['Math', 'Physics', 'Chemistry']].max()

In [39]:
print(highest_score)

Math         92
Physics      95
Chemistry    92
dtype: int64